bekencorp/armino/middleware/soc/bk7237/hal/jpeg_dec_hal.c
// Copyright 2020-2021 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include <common/bk_include.h>
#include "BK7256_RegList.h"
#include "arch_interrupt.h"
#include "gpio_map.h"
#include "gpio_driver.h"
#include "gpio_map.h"
#include <driver/int.h>
#include "dma_hal.h"
#include <driver/dma.h>
#include <os/mem.h>
#include "dma_driver.h"
#include "sys_driver.h"
#include "driver/jpeg_dec_types.h"
#include "jpeg_dec_macro_def.h"
#include "jpeg_dec_hal.h"
#include "sys_ll_op_if.h"


#define	LDB_WORD(ptr)		(uint16_t)(((uint16_t)*((uint8_t*)(ptr))<<8)|(uint16_t)*(uint8_t*)((ptr)+1))
#define ZIG(n)	Zig[n]
#define IPSF(n)	Ipsf[n]
static JPG_DECODER_ST jpg_dec_st;



uint8_t Zig[64] = {	/* Zigzag-order to raster-order conversion table */
	 0,  1,  8, 16,  9,  2,  3, 10, 17, 24, 32, 25, 18, 11,  4,  5,
	12, 19, 26, 33, 40, 48, 41, 34, 27, 20, 13,  6,  7, 14, 21, 28,
	35, 42, 49, 56, 57, 50, 43, 36, 29, 22, 15, 23, 30, 37, 44, 51,
	58, 59, 52, 45, 38, 31, 39, 46, 53, 60, 61, 54, 47, 55, 62, 63
};

static const uint16_t Ipsf[64] = {	/* See also aa_idct.png */
	(uint16_t)(1.00000*8192), (uint16_t)(1.38704*8192), (uint16_t)(1.30656*8192), (uint16_t)(1.17588*8192), (uint16_t)(1.00000*8192), (uint16_t)(0.78570*8192), (uint16_t)(0.54120*8192), (uint16_t)(0.27590*8192),
	(uint16_t)(1.38704*8192), (uint16_t)(1.92388*8192), (uint16_t)(1.81226*8192), (uint16_t)(1.63099*8192), (uint16_t)(1.38704*8192), (uint16_t)(1.08979*8192), (uint16_t)(0.75066*8192), (uint16_t)(0.38268*8192),
	(uint16_t)(1.30656*8192), (uint16_t)(1.81226*8192), (uint16_t)(1.70711*8192), (uint16_t)(1.53636*8192), (uint16_t)(1.30656*8192), (uint16_t)(1.02656*8192), (uint16_t)(0.70711*8192), (uint16_t)(0.36048*8192),
	(uint16_t)(1.17588*8192), (uint16_t)(1.63099*8192), (uint16_t)(1.53636*8192), (uint16_t)(1.38268*8192), (uint16_t)(1.17588*8192), (uint16_t)(0.92388*8192), (uint16_t)(0.63638*8192), (uint16_t)(0.32442*8192),
	(uint16_t)(1.00000*8192), (uint16_t)(1.38704*8192), (uint16_t)(1.30656*8192), (uint16_t)(1.17588*8192), (uint16_t)(1.00000*8192), (uint16_t)(0.78570*8192), (uint16_t)(0.54120*8192), (uint16_t)(0.27590*8192),
	(uint16_t)(0.78570*8192), (uint16_t)(1.08979*8192), (uint16_t)(1.02656*8192), (uint16_t)(0.92388*8192), (uint16_t)(0.78570*8192), (uint16_t)(0.61732*8192), (uint16_t)(0.42522*8192), (uint16_t)(0.21677*8192),
	(uint16_t)(0.54120*8192), (uint16_t)(0.75066*8192), (uint16_t)(0.70711*8192), (uint16_t)(0.63638*8192), (uint16_t)(0.54120*8192), (uint16_t)(0.42522*8192), (uint16_t)(0.29290*8192), (uint16_t)(0.14932*8192),
	(uint16_t)(0.27590*8192), (uint16_t)(0.38268*8192), (uint16_t)(0.36048*8192), (uint16_t)(0.32442*8192), (uint16_t)(0.27590*8192), (uint16_t)(0.21678*8192), (uint16_t)(0.14932*8192), (uint16_t)(0.07612*8192)
};

void hal_jpeg_dec_start(void)
{
	REG_DC_CLR;
	REG_DEC_START;
}


/** breaf   User defined input function 
 *  param1  Decompression object
 *  param2  Pointer to the read buffer (0:skip)
 *  param2  Number of bytes to read/skip
 */
static uint16_t jpeg_dec_input_func (JDEC* jd, uint8_t* buff, uint16_t ndata)
{
	if (jpg_dec_st.rd_ptr > jpg_dec_st.jpg_file_size)
	{
		//os_printf("jpg_dec_st.jpg_file_size = %x \r\n", jpg_dec_st.jpg_file_size);
		//os_printf("jpg_dec_st.rd_ptr = %x \r\n", jpg_dec_st.rd_ptr);
		return 0xffff;
	}
	if (NULL != buff)
	{
		os_memcpy(buff, jpg_dec_st.inputbuf + jpg_dec_st.rd_ptr,ndata);
	}
	//os_printf("buff = %x \r\n", buff);
	//os_printf("*buff = %x \r\n", *buff);
	//os_printf("jpg_dec_st.rd_ptr = %x \r\n", jpg_dec_st.rd_ptr);
	//os_printf("jpg_dec_st.inputbuf = %x\r\n", *(jpg_dec_st.inputbuf +jpg_dec_st.rd_ptr));

	jpg_dec_st.rd_ptr += ndata;
	return ndata;

}

int jpg_decoder_init(void)
{
//	jpg_dec_st.width = width;
//	jpg_dec_st.heigth = heigth;
	jpg_dec_st.scale_ratio = 0;
	jpg_dec_st.workbuf = os_malloc(WORK_AREA_SIZE);
	if (NULL == jpg_dec_st.workbuf)
	{
//		uart_printf("work area error!!\r\n");
		return -1;
	}
	return 0;
}

static void* alloc_pool (	/* Pointer to allocated memory block (NULL:no memory available) */
	JDEC* jd,		/* Pointer to the decompressor object */
	uint16_t nd		/* Number of bytes to allocate */
)
{
	char *rp = 0;


	nd = (nd + 3) & ~3;			/* Align block size to the word boundary */

	if (jd->sz_pool >= nd) {
		jd->sz_pool -= nd;
		rp = (char*)jd->pool;			/* Get start of available memory pool */
		jd->pool = (void*)(rp + nd);	/* Allocate requierd bytes */
	}

	return (void*)rp;	/* Return allocated memory block (NULL:no memory to allocate) */
}


/*-----------------------------------------------------------------------*/
/* Start to decompress the JPEG picture                                  */
/*-----------------------------------------------------------------------*/
JRESULT jd_decomp (
	JDEC* jd,								/* Initialized decompression object */
	uint8_t size, uint32_t *dec_src_addr, uint32_t *dec_dest_addr
)
{
	//uint16_t  mx, my;
	JRESULT rc;
    BASE_RADDR = (unsigned long)(dec_src_addr);
    BASE_WADDR = (unsigned long)(dec_dest_addr);
	
	BASE_RD_LEN = 20480*4-1;
	if(size  == 0)
		BASE_WR_LEN = 4147200;
	else if(size == 1)
	    BASE_WR_LEN = 1843200;
	else if(size == 2)
	    BASE_WR_LEN = 614400;
	else if(size == 3)
	    BASE_WR_LEN = 153600;
	else
	    BASE_WR_LEN = 261120; //lea add

	//mx = jd->msx * 8; my = jd->msy * 8;			/* Size of the MCU (pixel) */
    REG_JPEG_XPIXEL = jd->width;
	REG_DC_CLR;
	jd->dcv[2] = jd->dcv[1] = jd->dcv[0] = 0;	/* Initialize DC values */
	rc = JDR_OK;
	REG_DEC_START;
	return rc;
}

/*-----------------------------------------------------------------------*/
/* Analyze the JPEG image and Initialize decompressor object             */
/*-----------------------------------------------------------------------*/

/*-----------------------------------------------------------------------*/
/* Create de-quantization and prescaling tables with a DQT segment       */
/*-----------------------------------------------------------------------*/

static int create_qt_tbl (	/* 0:OK, !0:Failed */
	JDEC* jd,				/* Pointer to the decompressor object */
	const uint8_t* data,	/* Pointer to the quantizer tables */
	uint16_t ndata			/* Size of input data */
)
{
	uint16_t i;
	uint8_t d, z;
	int32_t *pb;


