bekencorp/armino/middleware/soc/bk7237/hal/jpeg_dec_hal.c
	while (ndata) {	/* Process all tables in the segment */
		if (ndata < 65) return JDR_FMT1;	/* Err: table size is unaligned */
		ndata -= 65;
		d = *data++;							/* Get table property */
		if (d & 0xF0) return JDR_FMT1;			/* Err: not 8-bit resolution */
		i = d & 3;								/* Get table ID */
		pb = alloc_pool(jd, 64 * sizeof (int32_t));/* Allocate a memory block for the table */
		if (!pb) return JDR_MEM1;				/* Err: not enough memory */
		jd->qttbl[i] = pb;						/* Register the table */
		for (i = 0; i < 64; i++) {				/* Load the table */
			z = ZIG(i);							/* Zigzag-order to raster-order conversion */
			REG_JPEG_PIPO_REG0 = z;
			REG_JPEG_PIPO_REG1 = *data;
			pb[z] = (int32_t)((uint32_t)*data++ * IPSF(z));	/* Apply scale factor of Arai algorithm to the de-quantizers */
			REG_JPEG_PIPO_REG1 = pb[z];			
		}
	}

	return JDR_OK;
}



static int create_huffman_tbl (	/* 0:OK, !0:Failed */
	JDEC* jd,					/* Pointer to the decompressor object */
	const uint8_t* data,		/* Pointer to the packed huffman tables */
	uint16_t ndata				/* Size of input data */
)
{
	uint16_t i, j, b, np, cls, num;
	uint8_t d, *pb, *pd;
	uint16_t hc, *ph;


	while (ndata) {	/* Process all tables in the segment */

		if (ndata < 17) return JDR_FMT1;	/* Err: wrong data size */
		ndata -= 17;
		d = *data++;						/* Get table number and class */
		if (d & 0xEE) return JDR_FMT1;		/* Err: invalid class/number */
		cls = d >> 4; num = d & 0x0F;		/* class = dc(0)/ac(1), table number = 0/1 */
		pb = alloc_pool(jd, 16);			/* Allocate a memory block for the bit distribution table */
		if (!pb) return JDR_MEM1;			/* Err: not enough memory */
		jd->huffbits[num][cls] = pb;
		for (np = i = 0; i < 16; i++) {		/* Load number of patterns for 1 to 16-bit code */
			np += (pb[i] = *data++);		/* Get sum of code words for each code */
		}
		ph = alloc_pool(jd, (uint16_t)(np * sizeof (uint16_t)));/* Allocate a memory block for the code word table */
		if (!ph) return JDR_MEM1;			/* Err: not enough memory */
		jd->huffcode[num][cls] = ph;
		hc = 0;
		for (j = i = 0; i < 16; i++) {		/* Re-build huffman code word table */
			b = pb[i];
			while (b--) ph[j++] = hc++;
			hc <<= 1;
		}

		if (ndata < np) return JDR_FMT1;	/* Err: wrong data size */
		ndata -= np;
		pd = alloc_pool(jd, np);			/* Allocate a memory block for the decoded data */
		if (!pd) return JDR_MEM1;			/* Err: not enough memory */
		jd->huffdata[num][cls] = pd;
		for (i = 0; i < np; i++) {			/* Load decoded data corresponds to each code ward */
			d = *data++;
			if (!cls && d > 11) return JDR_FMT1;
			*pd++ = d;
		}
	}

	return JDR_OK;
}

JRESULT jd_prepare (
	JDEC* jd,			/* Blank decompressor object */
	uint16_t (*infunc)(JDEC*, uint8_t*, uint16_t),	/* JPEG strem input function */
	void* pool,			/* Working buffer for the decompression session */
	uint16_t sz_pool,	/* Size of working buffer */
	void* dev			/* I/O device identifier for the session */
)
{
	uint8_t *seg, b;
	uint16_t marker;
	uint32_t ofs;
	uint32_t pointer;
	uint16_t n, i, j, len;
	JRESULT rc;
	uint8_t skip_get_mark = 0;

	if (!pool)
	{
		//os_printf("1--return = %d \r\n", JDR_PAR);
		return JDR_PAR;
	}
	jd->pool = pool;		/* Work memroy */
	jd->sz_pool = sz_pool;	/* Size of given work memory */
	jd->infunc = infunc;	/* Stream input function */
	jd->device = dev;		/* I/O device identifier */
	jd->nrst = 0;			/* No restart interval (default) */

	for (i = 0; i < 2; i++)
	{	/* Nulls pointers */
		for (j = 0; j < 2; j++)
		{
			jd->huffbits[i][j] = 0;
			jd->huffcode[i][j] = 0;
			jd->huffdata[i][j] = 0;
		}
	}
	for (i = 0; i < 4; jd->qttbl[i++] = 0) ;
	jd->inbuf = seg = alloc_pool(jd, JD_SZBUF);		/* Allocate stream input buffer */
	if (!seg)
	{
		//os_printf("JDR_MEM1--return = %d \r\n", JDR_MEM1);
		return JDR_MEM1;
	}
	if (jd->infunc(jd, seg, 2) != 2)
	{
		//os_printf("JDR_INP--return = %d \r\n", JDR_INP);
		return JDR_INP;/* Check SOI marker */
	}

	//os_printf("jd->inbuf = %x \r\n", *(jd->inbuf));
	//os_printf("jd->inbuf = %x \r\n", *(jd->inbuf + 1));
	//os_printf("jd->inbuf = %x \r\n", *(jd->inbuf + 2));
	//os_printf("jd->inbuf = %x \r\n", *(jd->inbuf + 3));
	//os_printf("jd->inbuf = %x \r\n", *(jd->inbuf + 4));

	if (LDB_WORD(seg) != 0xFFD8)
	{
		//os_printf("LDB_WORD(seg) = %x \r\n", LDB_WORD(seg));
		//os_printf("6 --JDR_FMT1--return = %x \r\n", JDR_FMT1);
		return JDR_FMT1;	/* Err: SOI is not detected */
	}

	ofs = 2;
	pointer = 2;

	for (;;)
	{
		if(0 == skip_get_mark)
		{
			/* Get a JPEG marker */
			if (jd->infunc(jd, seg, 4) != 4)
			{
				//os_printf("6-----JDR_INP = %x \r\n", jd->infunc(jd, seg, 4));
				//os_printf("6-----JDR_INP = %x \r\n", JDR_INP);
				return JDR_INP;
			}
			marker = LDB_WORD(seg);		/* Marker */
			len = LDB_WORD(seg + 2);	/* Length field */
			
			//os_printf("6-----marker = %x \r\n", marker);
			//os_printf("6-----len = %x \r\n", len);
			if((marker& 0xFF) != 0xFF) {
				//os_printf("6-----marker& 0xFF = %x \r\n", marker& 0xFF);
				pointer += 2 + len;
			}
			if (len <= 2 || (marker >> 8) != 0xFF) {
				//os_printf("6-----JDR_INP = %x \r\n", JDR_INP);
				return JDR_FMT1;
			}
			len -= 2;		/* Content size excluding length field */
			ofs += 4 + len;	/* Number of bytes loaded */
			BASE_FFDA = pointer;
		}
		
		skip_get_mark = 0;
		//os_printf("7-----JPEGDEC_INTEN = %x \r\n", JPEGDEC_INTEN);

		switch (marker & 0xFF) {
		case 0xC0:	/* SOF0 (baseline JPEG) */
			/* Load segment data */

			if (len > JD_SZBUF)
				return JDR_MEM2;
			if (jd->infunc(jd, seg, len) != len)
			{
				return JDR_INP;
			}

			jd->width = LDB_WORD(seg+3);		/* Image width in unit of pixel */
			jd->height = LDB_WORD(seg+1);		/* Image height in unit of pixel */

			//os_printf("jd->width = %x \r\n", LDB_WORD(seg+3));
			//os_printf("jd->height = %x \r\n", LDB_WORD(seg+1));
			//os_printf("jd->height = %x \r\n", seg[5]);
			if (seg[5] != 3)
			{
				os_printf("7--JDR_FMT3-- = %x \r\n", JDR_FMT3);
				return JDR_FMT3;	/* Err: Supports only Y/Cb/Cr format */
			}

			/* Check three image components */
			for (i = 0; i < 3; i++)
			{
				b = seg[7 + 3 * i];	/* Get sampling factor */
				if (!i)
				{	/* Y component */
					if (b != 0x11 && b != 0x22 && b != 0x21)
					{	/* Check sampling factor */
						return JDR_FMT3;/* Err: Supports only 4:4:4, 4:2:0 or 4:2:2 */
					}
					jd->msx = b >> 4; jd->msy = b & 15;/* Size of MCU [blocks] */
				}
				else
				{	/* Cb/Cr component */
					if (b != 0x11)
					{
						return JDR_FMT3;/* Err: Sampling factor of Cr/Cb must be 1 */
					}
				}
				b = seg[8 + 3 * i];	/* Get dequantizer table ID for this component */
				if (b > 3)
				{
					return JDR_FMT3;/* Err: Invalid ID */
				}
				jd->qtid[i] = b;
			}
			break;

		case 0xDD:	/* DRI */
			/* Load segment data */
			if (len > JD_SZBUF) return JDR_MEM2;
			if (jd->infunc(jd, seg, len) != len)
			{
				return JDR_INP;
			}

			/* Get restart interval (MCUs) */
			jd->nrst = LDB_WORD(seg);
			break;

		case 0xC4:	/* DHT */
			/* Load segment data */
			if (len > JD_SZBUF)
				return JDR_MEM2;
			if (jd->infunc(jd, seg, len) != len)
			{
				return JDR_INP;
			}

