bekencorp/armino/middleware/soc/bk7237/hal/jpeg_dec_hal.c
			/* Create huffman tables */
			rc = create_huffman_tbl(jd, seg, len);
			//os_printf("0xC4-----JPEGDEC_INTEN = %d \r\n", JPEGDEC_INTEN);
			if (rc)
				return rc;
			break;

		case 0xDB:	/* DQT */
			/* Load segment data */
			if (len > JD_SZBUF)
				return JDR_MEM2;
			if (jd->infunc(jd, seg, len) != len)
				return JDR_INP;

			/* Create de-quantizer tables */
			rc = create_qt_tbl(jd, seg, len);
			//os_printf("0xDB-----JPEGDEC_INTEN = %d \r\n", JPEGDEC_INTEN);
			if (rc)
				return rc;
			break;

		case 0xDA:	/* SOS */
			/* Load segment data */
			if (len > JD_SZBUF)
				return JDR_MEM2;
			if (jd->infunc(jd, seg, len) != len)
				return JDR_INP;

			if (!jd->width || !jd->height)
				return JDR_FMT1;	/* Err: Invalid image size */

			if (seg[0] != 3)
				return JDR_FMT3;				/* Err: Supports only three color components format */

			/* Check if all tables corresponding to each components have been loaded */
			for (i = 0; i < 3; i++)
			{
				b = seg[2 + 2 * i];	/* Get huffman table ID */
				if (b != 0x00 && b != 0x11)	return JDR_FMT3;	/* Err: Different table number for DC/AC element */
				b = i ? 1 : 0;
				if (!jd->huffbits[b][0] || !jd->huffbits[b][1])
				{	/* Check dc/ac huffman table for this component */
					return JDR_FMT1;					/* Err: Nnot loaded */
				}
				if (!jd->qttbl[jd->qtid[i]])
				{			/* Check dequantizer table for this component */
					return JDR_FMT1;					/* Err: Not loaded */
				}
			}

			/* Allocate working buffer for MCU and RGB */
			n = jd->msy * jd->msx;						/* Number of Y blocks in the MCU */
			if (!n) return JDR_FMT1;					/* Err: SOF0 has not been loaded */
			len = n * 64 * 2 + 64;						/* Allocate buffer for IDCT and RGB output */
			if (len < 256) len = 256;					/* but at least 256 byte is required for IDCT */
			jd->workbuf = alloc_pool(jd, len);			/* and it may occupy a part of following MCU working buffer for RGB output */
			if (!jd->workbuf) return JDR_MEM1;			/* Err: not enough memory */
			jd->mcubuf = (uint8_t*)alloc_pool(jd, (uint16_t)((n + 2) * 64));	/* Allocate MCU working buffer */
			if (!jd->mcubuf) return JDR_MEM1;			/* Err: not enough memory */

			/* Pre-load the JPEG data to extract it from the bit stream */
			jd->dptr = seg; jd->dctr = 0; jd->dmsk = 0;	/* Prepare to read bit stream */
			if (ofs %= JD_SZBUF)
			{
			/* Align read offset to JD_SZBUF */
//				jd->dctr = jd->infunc(jd, seg + ofs, (uint16_t)(JD_SZBUF - ofs));
//				jd->dptr = seg + ofs - 1;
//			   DEBUG5 = ofs;
			}

			return JDR_OK;		/* Initialization succeeded. Ready to decompress the JPEG image. */

		case 0xC1:	/* SOF1 */
		case 0xC2:	/* SOF2 */
		case 0xC3:	/* SOF3 */
		case 0xC5:	/* SOF5 */
		case 0xC6:	/* SOF6 */
		case 0xC7:	/* SOF7 */
		case 0xC9:	/* SOF9 */
		case 0xCA:	/* SOF10 */
		case 0xCB:	/* SOF11 */
		case 0xCD:	/* SOF13 */
		case 0xCE:	/* SOF14 */
		case 0xCF:	/* SOF15 */
		case 0xD9:	/* EOI */
			return JDR_FMT3;	/* Unsuppoted JPEG standard (may be progressive JPEG) */

		/*skip the first maker flag(0xff),treat the following 0xff as the flag*/
		case 0xFF:
			if(0xff != seg[2])
			{
				pointer += 3;
	      BASE_FFDA = pointer;				
				marker = seg[2];
				if(jd->infunc(jd, &seg[4], 1) != 1)
				{
					return JDR_INP;
				}
				len = LDB_WORD(&seg[3]);
				if (len <= 2 )
					return JDR_FMT1;
			}
			else
			{
				if(0xff != seg[3])
				{
					pointer += 4;
					BASE_FFDA = pointer;
					marker = seg[3];
					if(jd->infunc(jd, seg, 2) != 2)
						return JDR_INP;
				}
				else
				{
					pointer += 4;
					while(1)
					{
						if(jd->infunc(jd, seg, 1) != 1)
						{
							return JDR_INP;
						}
						if(0xff == seg[0])
						{				
							pointer += 1;
							BASE_FFDA = pointer;
							continue;
            }
						marker = seg[0];
						pointer += 1;
	          BASE_FFDA = pointer;						
						if(jd->infunc(jd, seg, 2) != 2)
							return JDR_INP;
						break;
					}
				}

				len = LDB_WORD(seg);
				pointer += len;
				BASE_FFDA = pointer;
				if (len <= 2 )
					return JDR_FMT1;
			}
			len -= 2;
			skip_get_mark = 1;
			break;
		//os_printf("11-----JPEGDEC_INTEN = %d \r\n", JPEGDEC_INTEN);

		default:	/* Unknown segment (comment, exif or etc..) */
			/* Skip segment data */
			if (jd->infunc(jd, 0, len) != len)
			{	/* Null pointer specifies to skip bytes of stream */
					return JDR_INP;
			}
		}
	}
}


void JpegdecInit(JDEC* jdec,uint32_t * dec_src_addr)
{
	uint32_t xs;
	uint32_t bits_num = 0, i;
	volatile unsigned long * huf_pointer;
	volatile unsigned long * zig_pointer;
	volatile unsigned long * dqt_pointer;
//    long tmp;
	JPEGDEC_INTEN = 0x40;  
    REG_JPEG_MCUX = 0;
    REG_JPEG_MCUY = 0;
	
	//os_printf("5-----JPEGDEC_INTEN = %x \r\n", JPEGDEC_INTEN);
	
	//*Y_buf = NULL;
	jpg_dec_st.inputbuf = (unsigned char *)dec_src_addr;
	jpg_dec_st.rd_ptr = 0;//init rd pointer
	jpg_dec_st.jpg_file_size = 1024;

	jd_prepare(jdec, jpeg_dec_input_func, jpg_dec_st.workbuf, WORK_AREA_SIZE, NULL);
	//os_printf("12-----JPEGDEC_INTEN = %x \r\n", JPEGDEC_INTEN);
	//os_printf("12---BASE_FFDA = %x \r\n", BASE_FFDA);

	huf_pointer = &REG_JPEG_TMP0;
	for(i = 0; i < 64; i = i + 1)
		 *(huf_pointer + i) = 0;

	REG_JPEG_BITS_DC00 = *((*jdec).huffbits[0][0] + 0);
	REG_JPEG_BITS_DC01 = *((*jdec).huffbits[0][0] + 1);
	REG_JPEG_BITS_DC02 = *((*jdec).huffbits[0][0] + 2);
	REG_JPEG_BITS_DC03 = *((*jdec).huffbits[0][0] + 3);
	REG_JPEG_BITS_DC04 = *((*jdec).huffbits[0][0] + 4);
	REG_JPEG_BITS_DC05 = *((*jdec).huffbits[0][0] + 5);
	REG_JPEG_BITS_DC06 = *((*jdec).huffbits[0][0] + 6);
	REG_JPEG_BITS_DC07 = *((*jdec).huffbits[0][0] + 7);
	REG_JPEG_BITS_DC08 = *((*jdec).huffbits[0][0] + 8);
	REG_JPEG_BITS_DC09 = *((*jdec).huffbits[0][0] + 9);
	REG_JPEG_BITS_DC0A = *((*jdec).huffbits[0][0] + 10);
	REG_JPEG_BITS_DC0B = *((*jdec).huffbits[0][0] + 11);
	REG_JPEG_BITS_DC0C = *((*jdec).huffbits[0][0] + 12);
	REG_JPEG_BITS_DC0D = *((*jdec).huffbits[0][0] + 13);
	REG_JPEG_BITS_DC0E = *((*jdec).huffbits[0][0] + 14);
	REG_JPEG_BITS_DC0F = *((*jdec).huffbits[0][0] + 15);	
	
	for(i = 0; i < 16; i = i + 1)
	{
	  bits_num = bits_num + *((*jdec).huffbits[0][0] + i);
//	  addJPEG_DEC_Reg0x1 = bits_num;
	}
	//os_printf("13-----bits_num = %d \r\n", bits_num);

	
	huf_pointer = &REG_JPEG_HUF_TABLE00;
  for(i = 0; i < bits_num; i = i + 1)
	  *(huf_pointer + i) = (*((*jdec).huffcode[0][0] + i) << 8) + *((*jdec).huffdata[0][0] + i);

  //ind 10
	REG_JPEG_BITS_DC10 = *((*jdec).huffbits[1][0] + 0); 
	REG_JPEG_BITS_DC11 = *((*jdec).huffbits[1][0] + 1); 
	REG_JPEG_BITS_DC12 = *((*jdec).huffbits[1][0] + 2); 
	REG_JPEG_BITS_DC13 = *((*jdec).huffbits[1][0] + 3); 
	REG_JPEG_BITS_DC14 = *((*jdec).huffbits[1][0] + 4); 
	REG_JPEG_BITS_DC15 = *((*jdec).huffbits[1][0] + 5); 
	REG_JPEG_BITS_DC16 = *((*jdec).huffbits[1][0] + 6); 
	REG_JPEG_BITS_DC17 = *((*jdec).huffbits[1][0] + 7); 
	REG_JPEG_BITS_DC18 = *((*jdec).huffbits[1][0] + 8); 
	REG_JPEG_BITS_DC19 = *((*jdec).huffbits[1][0] + 9); 
	REG_JPEG_BITS_DC1A = *((*jdec).huffbits[1][0] + 10);
	REG_JPEG_BITS_DC1B = *((*jdec).huffbits[1][0] + 11);
	REG_JPEG_BITS_DC1C = *((*jdec).huffbits[1][0] + 12);
	REG_JPEG_BITS_DC1D = *((*jdec).huffbits[1][0] + 13);
	REG_JPEG_BITS_DC1E = *((*jdec).huffbits[1][0] + 14);
	REG_JPEG_BITS_DC1F = *((*jdec).huffbits[1][0] + 15);
  
  bits_num = 0;	
	for(i = 0; i < 16; i = i + 1)
	{
	  bits_num = bits_num + *((*jdec).huffbits[1][0] + i);
//	  addJPEG_DEC_Reg0x1 = bits_num;
	}

	huf_pointer = &REG_JPEG_HUF_TABLE10;
  for(i = 0; i < bits_num; i = i + 1)
	  *(huf_pointer + i) = (*((*jdec).huffcode[1][0] + i) << 8) + *((*jdec).huffdata[1][0] + i);
		
  //ind 01
	REG_JPEG_BITS_AC00 = *((*jdec).huffbits[0][1] + 0);
	REG_JPEG_BITS_AC01 = *((*jdec).huffbits[0][1] + 1);
	REG_JPEG_BITS_AC02 = *((*jdec).huffbits[0][1] + 2);
	REG_JPEG_BITS_AC03 = *((*jdec).huffbits[0][1] + 3);
	REG_JPEG_BITS_AC04 = *((*jdec).huffbits[0][1] + 4);
	REG_JPEG_BITS_AC05 = *((*jdec).huffbits[0][1] + 5);
	REG_JPEG_BITS_AC06 = *((*jdec).huffbits[0][1] + 6);
	REG_JPEG_BITS_AC07 = *((*jdec).huffbits[0][1] + 7);
	REG_JPEG_BITS_AC08 = *((*jdec).huffbits[0][1] + 8);
	REG_JPEG_BITS_AC09 = *((*jdec).huffbits[0][1] + 9);
	REG_JPEG_BITS_AC0A = *((*jdec).huffbits[0][1] + 10);
	REG_JPEG_BITS_AC0B = *((*jdec).huffbits[0][1] + 11);
	REG_JPEG_BITS_AC0C = *((*jdec).huffbits[0][1] + 12);
	REG_JPEG_BITS_AC0D = *((*jdec).huffbits[0][1] + 13);
	REG_JPEG_BITS_AC0E = *((*jdec).huffbits[0][1] + 14);
	REG_JPEG_BITS_AC0F = *((*jdec).huffbits[0][1] + 15);
	 bits_num = 0; 
	for(i = 0; i < 16; i = i + 1)
	{
	  bits_num = bits_num + *((*jdec).huffbits[0][1] + i);
//	  addJPEG_DEC_Reg0x1 = bits_num;
	}



	huf_pointer = &REG_JPEG_HUF_TABLE01;
  for(i = 0; i < bits_num; i = i + 1)
	  *(huf_pointer + i) = (*((*jdec).huffcode[0][1] + i) << 8) + *((*jdec).huffdata[0][1] + i);

