bekencorp/armino/middleware/soc/bk7237/hal/jpeg_dec_hal.c
  //ind 11
	REG_JPEG_BITS_AC10 = *((*jdec).huffbits[1][1] + 0);
	REG_JPEG_BITS_AC11 = *((*jdec).huffbits[1][1] + 1);
	REG_JPEG_BITS_AC12 = *((*jdec).huffbits[1][1] + 2);
	REG_JPEG_BITS_AC13 = *((*jdec).huffbits[1][1] + 3);
	REG_JPEG_BITS_AC14 = *((*jdec).huffbits[1][1] + 4);
	REG_JPEG_BITS_AC15 = *((*jdec).huffbits[1][1] + 5);
	REG_JPEG_BITS_AC16 = *((*jdec).huffbits[1][1] + 6);
	REG_JPEG_BITS_AC17 = *((*jdec).huffbits[1][1] + 7);
	REG_JPEG_BITS_AC18 = *((*jdec).huffbits[1][1] + 8);
	REG_JPEG_BITS_AC19 = *((*jdec).huffbits[1][1] + 9);
	REG_JPEG_BITS_AC1A = *((*jdec).huffbits[1][1] + 10);
	REG_JPEG_BITS_AC1B = *((*jdec).huffbits[1][1] + 11);
	REG_JPEG_BITS_AC1C = *((*jdec).huffbits[1][1] + 12);
	REG_JPEG_BITS_AC1D = *((*jdec).huffbits[1][1] + 13);
	REG_JPEG_BITS_AC1E = *((*jdec).huffbits[1][1] + 14);
	REG_JPEG_BITS_AC1F = *((*jdec).huffbits[1][1] + 15);
	 bits_num = 0; 
	for(i = 0; i < 16; i = i + 1)
	{
	  bits_num = bits_num + *((*jdec).huffbits[1][1] + i);
//	  addJPEG_DEC_Reg0x1 = bits_num;
	}

	huf_pointer = &REG_JPEG_HUF_TABLE11;
  for(i = 0; i < bits_num; i = i + 1)
	  *(huf_pointer + i) = (*((*jdec).huffcode[1][1] + i) << 8) + *((*jdec).huffdata[1][1] + i);

  dqt_pointer	= &REG_JPEG_DQT_TABLE0;
  for(i = 0; i < 64; i = i + 1)
	  *(dqt_pointer + i) = (*((*jdec).qttbl[0] + i));
	
  dqt_pointer	= &REG_JPEG_DQT_TABLE1;
  for(i = 0; i < 64; i = i + 1)
	  *(dqt_pointer + i) = (*((*jdec).qttbl[1] + i));	

  zig_pointer	= &REG_JPEG_Zig;
  for(i = 0; i < 64; i = i + 1)
	  *(zig_pointer + i) = (unsigned long)Zig[i];
	
	REG_JPEG_ACC_REG0 = 3;

//	if (JDR_OK != ret)
//		return -1;
	xs = (*jdec).width >> jpg_dec_st.scale_ratio;
	//ys = (*jdec).height >> jpg_dec_st.scale_ratio;
	jpg_dec_st.width = (*jdec).width;
	jpg_dec_st.heigth = (*jdec).height;
	jpg_dec_st.line_wbyte = xs;//only output Y
//	jpg_dec_st.outputbuf = malloc(xs * ys);
//	printf("Y buffer: %d * %d\r\n", xs, ys);
//	if (NULL == jpg_dec_st.outputbuf)
//	{
//		printf("Y buffer malloc failed\r\n");
//		return -1;
//	}
//	*Y_buf = jpg_dec_st.outputbuf;  
}



















